In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import statistics

from scipy.stats import ttest_ind
%matplotlib inline

In [2]:
data = pd.read_csv('plane_crashes_data.csv')

In [3]:
df = pd.DataFrame(data)

In [5]:
df.head()

,month,hour,year,location,operator,route,type,aboard,fatalities,summary
0,1,12,1950,"Near Vacas, Bolivia",Military - Bolivian Air Force,Valle grande - Cochabamba,Douglas C-47,32,32,Crashed while en route in the Andes mountains ...
1,3,20,1950,"Minneapolis, Minnesota",Northwest Orient Airlines,Rochester Minn. - Minneapolis,Martin 202,13,13,"Crashed into a flag pole, well marked by red n..."
2,3,14,1950,"Llandow Airport, Cardiff, Wales",Fairflight Ltd.,Llandow - Dublin,Avro 689 Tudor 5,83,80,During the approach to Runway 28 at Llandow Ai...
3,4,23,1950,"Near Atsugi, Japan",Military - U.S. Air Force,Philippines - Japan,Douglas C-54D,35,35,Flew off its prescribed course and crashed int...
4,5,20,1950,"Lagens Air Force Base, Azores",Military - U.S. Air Force,Bermuda - England,Boeing B-29,16,16,Crashed while attempting to land after being d...

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2709 entries, 0 to 2708
Data columns (total 10 columns):
month         2709 non-null int64
hour          2709 non-null object
year          2709 non-null int64
location      2706 non-null object
operator      2707 non-null object
route         2318 non-null object
type          2708 non-null object
aboard        2709 non-null int64
fatalities    2709 non-null int64
summary       2696 non-null object
dtypes: int64(4), object(6)
memory usage: 211.7+ KB

In [7]:
df.describe()

             month         year       aboard   fatalities
count  2709.000000  2709.000000  2709.000000  2709.000000
mean      6.554079  1981.927279    35.817276    25.816537
std       3.532468    16.709136    54.306779    42.599461
min       1.000000  1950.000000     0.000000     0.000000
25%       3.000000  1968.000000     5.000000     3.000000
50%       7.000000  1983.000000    15.000000     9.000000
75%      10.000000  1997.000000    44.000000    29.000000
max      12.000000  2009.000000   644.000000   583.000000

In [8]:
(1/6)**6

2.1433470507544573e-05

In [9]:
6**6

46656

In [76]:
1/5757500

1.7368649587494573e-07

In [75]:
(4/50)*(3/49)*(2/48)*(1/47)*(1/25)

1.736864958749457e-07

In [28]:
df_new = df[df['year']>=1980]

In [33]:
np.mean(df_new.fatalities)

24.932607215793055

In [36]:
np.max(df.fatalities)

583

In [71]:
np.max(df.groupby('month'))

          hour  year  aboard  fatalities
month
1      c: 9:40  2009     213         213
2            9  2009     356         275
3            9  2009     644         583
4            9  2009     330         264
5            9  2009     271         271
6            9  2009     329         329
7            9  2008     517         290
8            9  2008     524         520
9            9  2008     394         269
10     c:09:00  2008     226         217
11           9  2008     349         349
12      c14:30  2008     393         259

In [68]:
df[df['fatalities']>=1].count()

month         2660
hour          2660
year          2660
location      2657
operator      2658
route         2279
type          2659
aboard        2660
fatalities    2660
summary       2647
dtype: int64

In [66]:
df.count()

month         2709
hour          2709
year          2709
location      2706
operator      2707
route         2318
type          2708
aboard        2709
fatalities    2709
summary       2696
dtype: int64

In [69]:
len(df[df['fatalities']>=1])/len(df)

0.9819121447028424

In [70]:
np.mean(df['fatalities']/df['aboard'])

0.8231319223510563